n5/src/Documents/SplitRange/SplitRange.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SplitRange</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.RangeStatuses</registerRecords>
  <registerRecords>InformationRegister.RangeLocations</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Range</name>
    <type>
      <types>CatalogRef.Ranges</types>
    </type>
  </attributes>
  <attributes>
    <name>Range1</name>
    <type>
      <types>CatalogRef.Ranges</types>
    </type>
  </attributes>
  <attributes>
    <name>Range2</name>
    <type>
      <types>CatalogRef.Ranges</types>
    </type>
  </attributes>
  <attributes>
    <name>Splitter</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

n5/src/InformationRegisters/Ranges/Ranges.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Ranges</name>
  <resources>
    <name>Last</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Range</name>
    <type>
      <types>CatalogRef.Ranges</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/InformationRegisters/RangeStatuses/RangeStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>RangeStatuses</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Status</name>
    <type>
      <types>EnumRef.RangeStatuses</types>
    </type>
  </resources>
  <dimensions>
    <name>Range</name>
    <type>
      <types>CatalogRef.Ranges</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/InformationRegisters/RangeLocations/RangeLocations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>RangeLocations</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </resources>
  <dimensions>
    <name>Range</name>
    <type>
      <types>CatalogRef.Ranges</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/Enums/RangeStatuses/RangeStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>RangeStatuses</name>
  <enumValues>
    <name>Active</name>
  </enumValues>
  <enumValues>
    <name>Finished</name>
  </enumValues>
  <enumValues>
    <name>Split</name>
  </enumValues>
  <enumValues>
    <name>WrittenOff</name>
  </enumValues>
</mdclass:Enum>

n5/src/Catalogs/Ranges/Ranges.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Ranges</name>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Capacity</name>
    <type>
      <types>DefinedType.Quantity</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim1</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim2</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim3</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Feature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </attributes>
  <attributes>
    <name>Finish</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>Length</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Online</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Package</name>
    <type>
      <types>CatalogRef.Packages</types>
    </type>
  </attributes>
  <attributes>
    <name>Prefix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Print</name>
    <type>
      <types>EnumRef.Print</types>
    </type>
  </attributes>
  <attributes>
    <name>Product</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductFeature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </attributes>
  <attributes>
    <name>Real</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Received</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Series</name>
    <type>
      <types>CatalogRef.Series</types>
    </type>
  </attributes>
  <attributes>
    <name>Source</name>
    <type>
      <types>CatalogRef.Ranges</types>
    </type>
  </attributes>
  <attributes>
    <name>Start</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.Forms</types>
    </type>
  </attributes>
</mdclass:Catalog>

n5/src/Documents/SplitRange/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure PresentationFieldsGetProcessing ( Fields, StandardProcessing )
	
	StandardProcessing = false;
	Fields.Add ( "Date" );
	Fields.Add ( "Range" );

EndProcedure

Procedure PresentationGetProcessing ( Data, Presentation, StandardProcessing )
	
	StandardProcessing = false;
	Presentation = Metadata.Documents.SplitRange.Synonym
	+ " "
	+ Data.Range
	+ ", "
	+ Format ( Data.Date, "DLF=D" );
	
EndProcedure

#region Posting

Function Post ( Env ) export
	
	getData ( Env );
	lock ( Env );
	if ( not make ( Env ) ) then
		return false;
	endif;
	flagRegisters ( Env );
	return true;
	
EndFunction

Procedure getData ( Env )

	sqlFields ( Env );
	Env.Q.SetParameter ( "Ref", Env.Ref );
	SQL.Perform ( Env );
	
EndProcedure

Procedure sqlFields ( Env )
	
	s = "
	|// @Fields
	|select Documents.Date as Date, Documents.Range as Range, Documents.Splitter as Splitter,
	|	Documents.Range1 as Range1, Documents.Range2 as Range2
	|from Document.SplitRange as Documents
	|where Documents.Ref = &Ref
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure lock ( Env )
	
	lock = new DataLock ();
	item = lock.Add ( "InformationRegister.Ranges" );
	item.Mode = DataLockMode.Exclusive;
	range = Env.Fields.Range;
	item.SetValue ( "Range", range );
	item = lock.Add ( "InformationRegister.RangeStatuses" );
	item.Mode = DataLockMode.Exclusive;
	item.SetValue ( "Range", range );
	item = lock.Add ( "InformationRegister.RangeLocations" );
	item.Mode = DataLockMode.Exclusive;
	item.SetValue ( "Range", range );
	lock.Lock ();
	
EndProcedure

Function make ( Env )
	
	fields = Env.Fields;
	splitter = fields.Splitter;
	data = rangeData ( Env );
	finish = data.Finish;
	last = data.Last;
	if ( ( finish - last ) < 2 ) then
		Output.RangeSplitError1 ( , "Range", Env.Ref );
		return false;
	elsif ( splitter < ( last + 1 )
		or splitter >= finish ) then
		Output.RangeSplitError2 ( , "Splitter", Env.Ref );
		return false;
	elsif ( data.Status <> Enums.RangeStatuses.Active ) then
		Output.RangeSplitError3 ( , "Range", Env.Ref );
		return false;
	endif;
	deactivate ( Env );
	activate ( Env, Data, fields.Range1 );
	activate ( Env, Data, fields.Range2 );
	return true;
	
EndFunction

Function rangeData ( Env )
	
	s = "
	|select Catalog.Finish as Finish, isnull ( Ranges.Last, Catalog.Start - 1 ) as Last,
	|	Statuses.Status as Status, Locations.Warehouse as Warehouse
	|from Catalog.Ranges as Catalog
	|	//
	|	// Ranges
	|	//
	|	left join InformationRegister.Ranges as Ranges
	|	on Ranges.Range = Catalog.Ref
	|	//
	|	// Statuses
	|	//
	|	left join InformationRegister.RangeStatuses.SliceLast ( &Date, Range = &Range ) as Statuses
	|	on true
	|	//
	|	// Locations
	|	//
	|	left join InformationRegister.RangeLocations.SliceLast ( &Date, Range = &Range ) as Locations
	|	on true
	|where Catalog.Ref = &Range
	|";
	q = new Query ( s );
	fields = Env.Fields;
	q.SetParameter ( "Range", fields.Range );
	q.SetParameter ( "Date", fields.Date - 1 );
	return q.Execute ().Unload () [ 0 ];
	
EndFunction

Procedure deactivate ( Env )
	
	fields = Env.Fields;
	movement = Env.Registers.RangeStatuses.Add ();
	movement.Period = fields.Date;
	movement.Range = fields.Range;
	movement.Status = Enums.RangeStatuses.Split;
	
EndProcedure

Procedure activate ( Env, RangeData, Range )
	
	fields = Env.Fields;
	date = fields.Date;
	movement = Env.Registers.RangeLocations.Add ();
	movement.Period = date;
	movement.Range = Range;
	movement.Warehouse = RangeData.Warehouse;
	movement = Env.Registers.RangeStatuses.Add ();
	movement.Period = date;
	movement.Range = Range;
	movement.Status = Enums.RangeStatuses.Active;
	
EndProcedure

Procedure flagRegisters ( Env )
	
	registers = Env.Registers;
	registers.RangeLocations.Write = true;
	registers.RangeStatuses.Write = true;
	
EndProcedure

#endregion

#endif
